
# Заповнюємо масив випадковоми числами

import random

def generuvaty_masyv( n, min, max ):
    m = []
    for _ in range(0,n):
            m.append(random.randint(min,max))
    return m

N = 20
masyv = generuvaty_masyv( N, 1, 20 )
print("Заданий масив:", masyv)

# Обчислити cкільки перших елементів потрібно просумувати, щоб сума була
# максимально близька до 50, але не перевищувала 50.

# Легенда:
# В черзі на завантаження на корабель стоять 20 контейнерів.
# Вага кожного контейнера є в масиві. Порядок елементів визначає пріоритет:
# нульовий контейнер треба брати першим, а за ним послідовно решту.
# Корабель може взяти на борт 50 тон контейнерів.
# Порахувати скільки контейнерів в порядку черги може взяти
# корабель на борт. 
